Мюнцкабинент_30/src/InformationRegisters/НомерВКоллекции/НомерВКоллекции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомерВКоллекции</name>
  <comment>Номера ячеек, в котоых хранится монеты</comment>
  <resources>
    <name>Номер</name>
    <comment>Номер ячейки в альбоме, в котором хранится монета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Монета</name>
    <type>
      <types>CatalogRef.Монеты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мюнцкабинент_30/src/InformationRegisters/НомерВКоллекции/ManagerModule.bsl
Процедура ЗаписатьНомер (Монета, Номер) Экспорт
	
	ТекущийНомер = ПолучитьНомер (Монета);
	Если Номер = ТекущийНомер Тогда
		Возврат
	КонецЕсли;	
	
	НЗ = РегистрыСведений.НомерВКоллекции.СоздатьНаборЗаписей();
	НЗ.Отбор.Монета.Установить (Монета);
	НЗ.Прочитать ();
	НЗ. Очистить ();
	
	НоваяЗапись 			= НЗ.Добавить();
	НоваяЗапись.Монета 	= Монета;
	НоваяЗапись.Номер		= Номер;
	
	НЗ.Записать ();
	
КонецПроцедуры	

Функция ПолучитьНомер (Монета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НомерВКоллекции.Номер
		|ИЗ
		|	РегистрСведений.НомерВКоллекции КАК НомерВКоллекции
		|ГДЕ
		|	НомерВКоллекции.Монета = &Монета";
	
	Запрос.УстановитьПараметр("Монета", Монета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Номер
	Иначе
		Возврат 0
	КонецЕсли;
	
КонецФункции
